Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The return value is a pointer to a *file object* that describes the opened file or ``NULL`` if there were any issues (e.g. the file wasn't found).
it_it: Il valore restituito è un puntatore a un *oggetto file* che descrive il file aperto oppure ``NULL`` in caso di problemi (ad esempio, il file non è stato trovato).

source: The return value is a pointer to the created widget of type ``lv_obj_t *``.
it_it: Il valore restituito è un puntatore al widget creato di tipo ``lv_obj_t *``.

source: The return value is the number of failed tests.
it_it: Il valore restituito è il numero di test falliti.

source: The return value of the function indicates whether at least one successful replacement took place.
it_it: Il valore restituito dalla funzione indica se è avvenuta almeno una sostituzione corretta.

source: The returned file object will be passed to other file system related callbacks.
it_it: L'oggetto file restituito verrà passato ad altre callback relative al file system.

source: The returned value is a pointer to the tile (a :ref:`base_widget`) on which the content of the tab can be created.
it_it: Il valore restituito è un puntatore al tile (un :ref:`base_widget`) su cui è possibile creare il contenuto del "tab".

source: The revision of the recipe.
it_it: La revisione della ricetta.

source: The root element is the Screen, which has no parent.
it_it: L'elemento "root" [radice] è lo Screen, che non ha un elemento padre.

source: The rotary sensitivity can be adjusted at two levels:
it_it: La sensibilità della rotazione può essere regolata a due livelli:

source: The rotation is done in software and only works if the display was created using :cpp:func:`lv_st_ltdc_create_partial`.
it_it: La rotazione viene eseguita tramite software e funziona solo se il display è stato creato utilizzando :cpp:func:`lv_st_ltdc_create_partial`.

source: The rotation is initially :cpp:enumerator:`LV_DISP_ROTATION_0`.
it_it: La rotazione è inizialmente :cpp:enumerator:`LV_DISP_ROTATION_0`.

source: The same environment can be shared across multiple glTF viewers for consistent lighting and reduced memory usage:
it_it: Lo stesso ambiente può essere condiviso tra più visualizzatori glTF per un'illuminazione uniforme e un utilizzo ridotto della memoria:

source: The same style can be used by any number of Widgets.
it_it: Lo stesso stile può essere utilizzato da un numero qualsiasi di widget.

source: The same works for display and input devices with ``lv_display_send_event(widget, <EVENT_CODE>, &some_data)`` and ``lv_indev_send_event(widget, <EVENT_CODE>, &some_data)``.
it_it: Lo stesso vale per i dispositivi di visualizzazione e input con ``lv_display_send_event(widget, <EVENT_CODE>, &some_data)`` e ``lv_indev_send_event(widget, <EVENT_CODE>, &some_data)``.

source: The scale adjustment can only be an integer multiple, for example, :cpp:expr:`lv_barcode_set_scale(barcode, 2)` means 2x scaling.
it_it: La regolazione della scala può essere solo un multiplo intero, ad esempio, :cpp:expr:`lv_barcode_set_scale(barcode, 2)` significa una scala 2x.

source: The scope can be omitted.
it_it: Lo scope può essere omesso.

source: The screen's content is different from the reference image.
it_it: Il contenuto dello schermo è diverso dall'immagine di riferimento.

source: The screenshot comparison uses ``lodepng`` which is built-in to LVGL and just needs to be enabled with ``LV_USE_LODEPNG``.
it_it: Il confronto degli screenshot utilizza ``lodepng``, che è integrato in LVGL e deve solo essere abilitato con ``LV_USE_LODEPNG``.

source: The script ``setup-build-env.sh`` looks like this:
it_it: Lo script ``setup-build-env.sh`` si presenta così:

source: The scrolling happens recursively therefore even nested scrollable Widgets are handled properly.
it_it: Lo scorrimento avviene in modo ricorsivo, quindi anche i Widget scorrevoli annidati vengono gestiti correttamente.

source: The scrolling slows down, and the content can be scrolled inside the Widget.
it_it: Lo scorrimento rallenta e il contenuto può essere fatto scorrere all'interno del Widget.

source: The second argument controls whether or not all devices are rescanned.
it_it: Il secondo argomento controlla se tutti i dispositivi vengono nuovamente scansionati o meno.

source: The second command should print ``aarch64``.
it_it: Il secondo comando dovrebbe stampare ``aarch64``.

source: The second is to build LVGL as either a shared or a static library.
it_it: Il secondo consiste nel compilare LVGL come libreria 'shared' o statica.

source: The second parameter specifies a prefix for screenshot comparison paths.
it_it: Il secondo parametro specifica un prefisso per i path di confronto degli screenshot.

source: The sequence of the Draw Unit list (with the Software Draw Unit at the end) also ensures that the Software Draw Unit is the "buck-stops-here" Draw Unit: if no other Draw Unit reported it was better at a given drawing task, then the Software Draw Unit will handle it.
it_it: La sequenza dell'elenco delle Draw Unit (con la Draw Unit Software alla fine) garantisce inoltre che la Draw Unit Software sia quella "responsabile": se nessun'altra Draw Unit ha segnalato di essere migliore in una determinata attività di disegno, allora la Draw Unit Software la gestirà.

source: The set-up steps below are for Linux, but they can be adapted for other platforms.
it_it: I passaggi di configurazione riportati di seguito sono per Linux, ma possono essere adattati ad altre piattaforme.

source: The shadow's size and position depend on the width, spread, and offset.
it_it: Le dimensioni e la posizione dell'ombra dipendono da larghezza, estensione e offset.

source: The shell offers enabling/disabling of LVGL monkeys:
it_it: La shell offre la possibilità di abilitare/disabilitare i dispositivi LVGL:

source: The simple way of installing Podman is via Terminal:
it_it: Il modo più semplice per installare Podman è tramite il Terminale:

source: The simplest and usually fastest gradient types are horizontal and vertical gradients.
it_it: I tipi di gradiente più semplici e solitamente più veloci sono i gradienti orizzontali e verticali.

source: The simplest case is linear, meaning the current value between *start* and *end* is changed at the same rate (i.e. with fixed steps) over the duration of the Animation.
it_it: Il caso più semplice è lineare, ovvero il valore corrente tra *inizio* e *fine* viene modificato alla stessa velocità (ovvero con incrementi fissi) per tutta la durata dell'animazione.

source: The simplest case is when the contribution is solely your own work.
it_it: Il caso più semplice è quando il contributo è esclusivamente frutto del proprio lavoro.

source: The simplest method is to use the `Online font converter <https://lvgl.io/tools/fontconverter>`__.
it_it: Il metodo più semplice è utilizzare il `Convertitore di font online <https://lvgl.io/tools/fontconverter>`__.

source: The simplest way to build LVGL using cmake is to use the command line calls:
it_it: Il modo più semplice per compilare LVGL con cmake è usare le chiamate da riga di comando:

source: The simplest way to install Podman is via ``brew`` using ``brew install podman``.
it_it: Il modo più semplice per installare Podman è tramite ``brew`` usando ``brew install podman``.

source: The simplest way to integrate LVGL into your ESP-IDF project is via the `esp_lvgl_port <https://components.espressif.com/components/espressif/esp_lvgl_port>`__ component.
it_it: Il modo più semplice per integrare LVGL nel proprio progetto ESP-IDF è tramite il componente `esp_lvgl_port <https://components.espressif.com/components/espressif/esp_lvgl_port>`__.

source: The simplest way to load a screen is using :cpp:expr:`lv_screen_load(scr1)`.
it_it: Il modo più semplice per caricare uno Screen è usare :cpp:expr:`lv_screen_load(scr1)`.

source: The simplest way to position a widget is by pixel values:
it_it: Il modo più semplice per posizionare un widget è tramite valori in pixel:

source: The simplest way to use an image in LVGL is to display it with an :ref:`lv_image` Widget:
it_it: Il modo più semplice per utilizzare un'immagine in LVGL è visualizzarla con un Widget :ref:`lv_image`:

source: The simulation repository for Visual Studio is available at https://github.com/pikasTech/lv_pikascript .
it_it: Il repository di simulazione per Visual Studio è disponibile all'indirizzo https://github.com/pikasTech/lv_pikascript .

source: The size of cache (in bytes) can be defined with :c:macro:`LV_CACHE_DEF_SIZE` in *lv_conf.h*.
it_it: La dimensione della cache (in byte) può essere definita con :c:macro:`LV_CACHE_DEF_SIZE` in *lv_conf.h*.

source: The size of cache can be changed at run-time with :cpp:expr:`lv_cache_set_max_size(size_t size)`, and retrieved with :cpp:expr:`lv_cache_get_max_size()`.
it_it: La dimensione della cache può essere modificata a run-time con :cpp:expr:`lv_cache_set_max_size(size_t size)` e recuperata con :cpp:expr:`lv_cache_get_max_size()`.

source: The size of the ``current_path`` buffer is set by :c:macro:`LV_FILE_EXPLORER_PATH_MAX_LEN` in ``lv_conf.h``.
it_it: La dimensione del buffer ``current_path`` è impostata da :c:macro:`LV_FILE_EXPLORER_PATH_MAX_LEN` in ``lv_conf.h``.

source: The size of the invalidated (redrawn) area can be controlled as follows:
it_it: La dimensione dell'area invalidata (ridisegnata) può essere controllata come segue:

source: The size of the tab bar can be adjusted by :cpp:expr:`lv_tabview_set_tab_bar_size(tabview, size)`.
it_it: La dimensione della barra dei "tab" può essere regolata tramite :cpp:expr:`lv_tabview_set_tab_bar_size(tabview, size)`.

source: The size of these chunks can be configured by the following properties in ``lv_conf.h``:
it_it: La dimensione di questi blocchi può essere configurata tramite le seguenti proprietà in ``lv_conf.h``:

source: The size should be set to the actual size of the texture primitive.
it_it: La dimensione deve essere impostata su quella effettiva della primitiva texture.

source: The snapshot image which is the draw buffer returned by :cpp:func:`lv_snapshot_take` normally won't be added to the cache because it can be drawn directly.
it_it: L'immagine snapshot, che è il buffer di disegno restituito da :cpp:func:`lv_snapshot_take` normalmente non verrà aggiunta alla cache perché può essere disegnata direttamente.

source: The sources come from ``lv_port_linux`` repository.
it_it: I sorgenti provengono dal repository ``lv_port_linux``.

source: The spaces surrounding substitutions are required for parsing, but when you need to remove them in the output (as in the example above), do so by escaping them with the \ character.
it_it: Gli spazi che circondano le sostituzioni sono necessari per il parsing, ma quando è necessario rimuoverli nell'output (come nell'esempio precedente), è possibile farlo utilizzando il carattere di escape \.

source: The speed ratio is calculated as: ``speed_value / LV_GLTF_ANIM_SPEED_NORMAL``
it_it: Il rapporto di velocità è calcolato come: ``speed_value / LV_GLTF_ANIM_SPEED_NORMAL``

source: The standard Latin-based languages (e.g., English, Spanish, German) and East Asian languages such as Chinese, Japanese, and Korean (CJK) are relatively straightforward, as their characters are simply written from left to right.
it_it: Le lingue standard basate sul latino (ad esempio, inglese, spagnolo, tedesco) e le lingue dell'Asia orientale come cinese, giapponese e coreano (CJK) sono relativamente semplici, poiché i loro caratteri vengono scritti semplicemente da sinistra a destra.

source: The start value must always be smaller than the end value.
it_it: Il valore iniziale deve essere sempre inferiore al valore finale.

source: The start value must be smaller than the end value.
it_it: Il valore iniziale deve essere inferiore al valore finale.

source: The string must begin with a printable ASCII character (range [0x20-0x7F]).
it_it: La stringa deve iniziare con un carattere ASCII stampabile (intervallo [0x20-0x7F]).

source: The struct :cpp:struct:`pxp_cfg_t` with callback pointers is used as a parameter for the :cpp:func:`lv_pxp_init` function.
it_it: La struttura :cpp:struct:`pxp_cfg_t` con puntatori di callback viene utilizzata come parametro per la funzione :cpp:func:`lv_pxp_init`.

source: The struct contains the following fields:
it_it: La struttura contiene i seguenti campi:

source: The structure within this folder often mimics the directory structure of a standard Linux system, containing directories like ``bin``, ``lib``, ``etc``, ``usr``, and others, which hold the binaries, libraries, configuration files, and other necessary components for the target system to function properly.
it_it: La struttura all'interno di questa cartella spesso imita la struttura delle directory di un sistema Linux standard, con directory come ``bin``, ``lib``, ``etc``, ``usr`` e altre, che contengono i file binari, le librerie, i file di configurazione e altri componenti necessari per il corretto funzionamento del sistema target.

source: The style properties listed by the plugin can be copy-pasted into any XML style section.
it_it: Le proprietà di stile elencate dal plugin possono essere copiate e incollate in qualsiasi sezione di stile XML.

source: The styles can be added to a widget's given :ref:`Part <basics_parts>` and :ref:`State <basics_states>`.
it_it: Gli stili possono essere aggiunti alla :ref:`Parte <basics_parts>` e allo :ref:`Stato <basics_states>`.

source: The sub-grid feature works the same as in CSS.
it_it: La funzionalità della sub-grid funziona come in CSS.

source: The sub-grid is resolved only to a depth of 1 level.
it_it: La sub-grid viene risolta solo fino a una profondità di 1 livello.

source: The subdirectories shown in the project are for the respective type of UI components (i.e. Screens, Widgets, Components, Fonts and Images).
it_it: Le sottodirectory visualizzate nel progetto sono per i rispettivi tipi di componenti dell'interfaccia utente (ad esempio Screen, Widget, Componenti, Font e Immagini).

source: The subscription is per-repository based and can be purchased for a month or year.
it_it: L'abbonamento è basato sul repository e può essere acquistato per un mese o un anno.

source: The supported color formats are:
it_it: I formati colore supportati sono:

source: The supported image color formats are RGB565, RGB565A8, ARGB8888, and L8.
it_it: I formati di colore immagine supportati sono RGB565, RGB565A8, ARGB8888 e L8.

source: The supported types are: - ``color`` - ``px`` - ``percentage`` - ``string`` - ``opa`` - ``bool``
it_it: I tipi supportati sono: - ``color`` - ``px`` - ``percentage`` - ``string`` - ``opa`` - ``bool``

source: The symbols have names like ``LV_SYMBOL_OK``, ``LV_SYMBOL_HOME``, etc.
it_it: I simboli hanno nomi come ``LV_SYMBOL_OK``, ``LV_SYMBOL_HOME``, ecc.

source: The symbols in the :ref:`built-in fonts <built_in_fonts>` are created from the `FontAwesome <https://fontawesome.com/>`__ font.
it_it: I simboli nei :ref:`font built-in <built_in_fonts>` sono creati a partire dal font `FontAwesome <https://fontawesome.com/>`__.

source: The sysroot-components directory helps optimize the build process because if one package changes, Yocto only needs to update the corresponding component rather than rebuilding or copying the entire sysroot.
it_it: La directory sysroot-components aiuta a ottimizzare il processo di build perché, se un pacchetto cambia, Yocto deve solo aggiornare il componente corrispondente anziché ricostruire o copiare l'intera sysroot.

source: The sysroots-uninative directory in Yocto is used to support the "uninative" feature, which allows for more reproducible builds by ensuring that the build environment remains consistent across different host systems.
it_it: La directory sysroots-uninative in Yocto viene utilizzata per supportare la funzionalità "uninative", che consente build più riproducibili garantendo che l'ambiente di build rimanga coerente su diversi sistemi host.

source: The tab buttons can be positioned on the top, bottom, left, and right side of the Tab View.
it_it: I pulsanti scheda possono essere posizionati in alto, in basso, a sinistra e a destra della "Tab View".

source: The target device contains `DMAC-350 <https://community.arm.com/arm-community-blogs/b/internet-of-things-blog/posts/arm-corelink-dma-350-next-generation-direct-memory-access-for-endpoint-ai>`__
it_it: Il dispositivo target contiene `DMAC-350 <https://community.arm.com/arm-community-blogs/b/internet-of-things-blog/posts/arm-corelink-dma-350-next-generation-direct-memory-access-for-endpoint-ai>`__

source: The target often equates to the first part of a recipe's filename (e.g. "foo" for a recipe named ``foo_1.3.0-r0.bb``).
it_it: Il target spesso corrisponde alla prima parte del nome file di una ricetta (ad esempio, "foo" per una ricetta denominata ``foo_1.3.0-r0.bb``).

source: The target processors are **Cortex-M55**, **Cortex-M52** and **Cortex-M85**
it_it: I processori target sono **Cortex-M55**, **Cortex-M52** e **Cortex-M85**

source: The target processors support `Helium <https://developer.arm.com/documentation/102102/0103/?lang=en>`__.
it_it: I processori target supportano `Helium <https://developer.arm.com/documentation/102102/0103/?lang=en>`__.

source: The temperature outside is 20\ |deg|\ C.
it_it: La temperatura esterna è di 20\ |deg|\ C.

source: The term "package" is sometimes used to refer to recipes.
it_it: Il termine "package" [pacchetto] viene talvolta utilizzato per riferirsi alle ricette.

source: The test display's content will be converted to ``XRGB8888`` to simplify comparison with the reference images.
it_it: Il contenuto del display di test verrà convertito in ``XRGB8888`` per semplificare il confronto con le immagini di riferimento.

source: The text can be modified with :cpp:expr:`lv_checkbox_set_text(cb, "New text")` and will be dynamically allocated.
it_it: Il testo può essere modificato con :cpp:expr:`lv_checkbox_set_text(cb, "New text")` e verrà allocato dinamicamente.

source: The text following the ``@see`` command will be indented.
it_it: Il testo che segue il comando ``@see`` verrà indentato.

source: The text is saved by the Table so the buffer containing the string can be a local variable.
it_it: Il testo viene salvato dalla Tabella, quindi il buffer contenente la stringa può essere una variabile locale.

source: The text is scrolled horizontally if it is longer than the button.
it_it: Il testo scorre orizzontalmente se è più lungo del pulsante.

source: The text of DCO can be read here: https://developercertificate.org/.
it_it: Il testo del DCO è disponibile qui: https://developercertificate.org/.

source: The text strings in ``lv_table``, ``lv_buttonmatrix``, ``lv_keyboard``, ``lv_tabview``, ``lv_dropdown``, ``lv_roller`` are "BiDi processed" to be displayed correctly
it_it: Le stringhe di testo in ``lv_table``, ``lv_buttonmatrix``, ``lv_keyboard``, ``lv_tabview``, ``lv_dropdown``, ``lv_roller`` sono "elaborati BiDi" per essere visualizzati correttamente

source: The text to render.
it_it: Testo da visualizzare.

source: The text will be broken into multiple lines, and the height will be set automatically.
it_it: Il testo verrà suddiviso in più righe e l'altezza verrà impostata automaticamente.

source: The textures are retrieved from the cache and reused when there is a match.
it_it: Le texture vengono recuperate dalla cache e riutilizzate quando viene rilevata una corrispondenza.

source: The third argument of the :cpp:func:`lv_lcd_generic_mipi_create` function is a flag array.
it_it: Il terzo argomento della funzione :cpp:func:`lv_lcd_generic_mipi_create` è un array di flag.

source: The third buffer is configured using the :cpp:func:`lv_display_set_3rd_draw_buffer` function.
it_it: Il terzo buffer viene configurato utilizzando la funzione :cpp:func:`lv_display_set_3rd_draw_buffer`.

source: The ticks can be padded in either direction (outwards or inwards) for ``..._ROUND_...`` Scales only with: :cpp:expr:`lv_obj_set_style_radial_offset(scale, 5, LV_PART_INDICATOR)` for major ticks and :cpp:expr:`lv_obj_set_style_radial_offset(scale, 5, LV_PART_ITEMS)` for minor.
it_it: Le tacche possono essere riempite in entrambe le direzioni (verso l'esterno o verso l'interno) per le Scale ``..._ROUND_...`` solo con: :cpp:expr:`lv_obj_set_style_radial_offset(scale, 5, LV_PART_INDICATOR)` per le tacche principali e :cpp:expr:`lv_obj_set_style_radial_offset(scale, 5, LV_PART_ITEMS)` per quelle secondarie.

source: The timing and limits of input devices can be configured via the following fields of :cpp:expr:`lv_indev_t`:
it_it: I tempi e i limiti dei dispositivi di input possono essere configurati tramite i seguenti campi di :cpp:expr:`lv_indev_t`:

source: The tools available in LVGL library will depend on the build configuration the recipe was done with.
it_it: I tool disponibili nella libreria LVGL dipenderanno dalla configurazione di build con cui è stata realizzata la ricetta.

source: The top-level `qnx` directory includes a recursive make file for building LVGL, both as a shared library and as a static library for the supported architectures.
it_it: La directory di livello superiore `qnx` include un file make ricorsivo per compilare LVGL, sia come libreria condivisa che come libreria statica per le architetture supportate.

source: The total memory available for layers at once is controlled by :c:macro:`LV_DRAW_LAYER_MAX_MEMORY` in ``lv_conf.h``.
it_it: La memoria totale disponibile per i layer contemporaneamente è controllata da :c:macro:`LV_DRAW_LAYER_MAX_MEMORY` in ``lv_conf.h``.

source: The total number of tasks rendered per refresh has an upper limit.
it_it: Il numero totale di attività renderizzate per aggiornamento ha un limite massimo.

source: The trace system has a configurable record buffer that stores the names of event functions and their timestamps.
it_it: Il sistema di "trace" dispone di un buffer di record configurabile che memorizza i nomi delle funzioni evento e i relativi timestamp.

source: The track's size can be set in pixels, to the largest item (:c:macro:`LV_GRID_CONTENT`), or to a fraction of the available free space (i.e. `Free [FR] Units <fr units_>`_) to distribute free space proportionally.
it_it: La dimensione della track può essere impostata in pixel, in base all'elemento più grande (:c:macro:`LV_GRID_CONTENT`) o in base a una frazione dello spazio libero disponibile (ad esempio `Free [FR] Units <fr units_>`_) per distribuire lo spazio libero in modo proporzionale.

source: The transition properties can be defined for each state.
it_it: Le proprietà della transizione possono essere definite per ogni stato.

source: The trickle mechanism only affects immediate children, not grandchildren or deeper descendants.
it_it: Il meccanismo di trickle riguarda solo i widget figli immediati, non i nipoti o i discendenti più profondi.

source: The two differences compared to borders in :cpp:type:`lv_draw_rect_dsc_t` are:
it_it: Le due differenze rispetto ai bordi in :cpp:type:`lv_draw_rect_dsc_t` sono:

source: The type :cpp:type:`lv_color_t` is used to store a color in RGB888 format.
it_it: Il tipo :cpp:type:`lv_color_t` viene utilizzato per memorizzare un colore in formato RGB888.

source: The types having the word "variable" in the "Form" column in the table above would support this approach if it was needed.
it_it: I tipi che contengono la parola "variable" nella colonna "Formato" della tabella soprastante supporterebbero questo approccio, se necessario.

source: The typical background style properties apply but usually it is left transparent.
it_it: Si applicano le tipiche proprietà di stile del background, ma di solito viene lasciato trasparente.
